app/Http/Controllers/DataUserController.php

SELECT * FROM `users` WHERE not `id` = '1' ORDER BY `created_at` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `users` WHERE not `id` = '1'
---
    public function index()
    {
        return view('admin.datauser.index', [
            "title" => "COURTIFY - Dashboard Data User",
            'datausers' => User::latest()->whereNot('id', '1')->filter(request(['search']))->paginate(5)