app/Http/Controllers/LapanganController.php

SELECT * FROM `lapangans` LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `lapangans`
---
    public function index()
    {
        return view('admin.lapangan.index', [
            "title" => "COURTIFY - Dashboard Lapangan",
            "lapangans" => Lapangan::filter(request(['search']))->paginate(10)
        ]);

SELECT * FROM `cabors`
---
    public function create()
    {
        return view('admin.lapangan.create', [
            "title" => "COURTIFY - Dashboard Lapangan",
            "cabors" => Cabor::all(),
        ]);

INSERT INTO `lapangans` (`nama`, `slug`, `cabor_id`, `tarif`, `alamat`, `thumbnail`, `deskripsi`, `updated_at`, `created_at`) VALUES ('Kalufa Court', 'kalufa-court', '1', '20.000', 'Krajan, Duwet Krajan, Kec. Tumpang, Kabupaten Malang, Jawa Timur 65156', 'lapangan-images/4xAfuGDyKC6343ypbGuoeD4RrHjmPRldE0qHimi0.png', 'coba lagi sampe mampus', '2024-02-12 09:18:26', '2024-02-12 09:18:26')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'nama' => 'required|max:255',
            'slug' => 'required|unique:lapangans',
            'cabor_id' => 'required',
            'tarif' => 'required',
            'alamat' => 'required',
            'thumbnail' => 'image|file|max:1024',
            'gambar1' => 'image|file|max:1024',
            'gambar2' => 'image|file|max:1024',
            'deskripsi' => 'required'
        ]);

            if($request->file('thumbnail')) {
                $validatedData['thumbnail'] = $request->file('thumbnail')->store('lapangan-images');
            }

            if($request->file('gambar1')) {
                $validatedData['gambar1'] = $request->file('gambar1')->store('lapangan-images');
            }

            if($request->file('gambar2')) {
                $validatedData['gambar2'] = $request->file('gambar2')->store('lapangan-images');
            }


            $validatedData['deskripsi'] = strip_tags($request->deskripsi);

            Lapangan::create($validatedData);

SELECT * FROM `cabors`
---
    public function edit(Lapangan $lapangan)
    {
        return view('admin.lapangan.edit', [
            "title" => "COURTIFY - Edit Lapangan",
            "lapangan" => $lapangan,
            "cabors" => Cabor::all()
        ]);

SELECT * FROM `lapangans` WHERE `id` in (27)
---
            $validatedData['gambar2'] = $request->file('gambar2')->store('lapangan-images');
        }

        Lapangan::where('id', $lapangan->id)
                    ->update($validatedData);

DELETE FROM `lapangans` WHERE `id` = 27
---
    public function destroy(Lapangan $lapangan)
    {
        if($lapangan->thumbnail) {
            Storage::delete($lapangan->thumbnail);