app/Http/Controllers/PertanyaanController.php

SELECT * FROM `pertanyaans` ORDER BY `created_at` DESC LIMIT 5 offset 5
SELECT count(*) as aggregate FROM `pertanyaans`
---
    public function index()
    {
        return view('admin.pertanyaan.index', [
            "title" => "COURTIFY - Dashboard Pertanyaan",
            "pertanyaans" => Pertanyaan::latest()->filter(request(['search']))->paginate(5)
        ]);