app/Http/Controllers/ShopcatalogController.php

SELECT * FROM `cabors` WHERE `slug` = 'futsal' LIMIT 1
SELECT count(*) as aggregate FROM `lapangans`
SELECT * FROM `cabors` WHERE `cabors`.`id` in (1, 2, 3, 4, 5, 6)
SELECT * FROM `lapangans` ORDER BY `created_at` DESC
SELECT * FROM `cabors` WHERE `cabors`.`id` in (1)
SELECT * FROM `lapangans` ORDER BY `created_at` DESC LIMIT 12 offset 0
---
    public function index()
    {
        $banner = "SEWA LAPANGAN TERBAIKMU DISINI";
        if(request('cabor')) {
            $cabor = Cabor::firstWhere('slug', request('cabor'));
            $banner = ' Lapangan ' . $cabor->name;
        }
        return view('shopcatalog', [
            "title" => "COURTIFY - Catalog",
            "banner" => $banner,
            "breadcrumbs" => "Sewa lapangan",
            "lapangans" => Lapangan::latest()->filter(request(['search', 'cabor']))->paginate(12)->withQueryString()
        ]);